# IESFileNotFoundWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..IlluminationFailures..::..IESFileNotFoundWarning Property
BuiltInFailures..::..IlluminationFailures Class See Also
---
Estimated Illumination failed. IES file not found for lighting fixture.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId IESFileNotFoundWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IESFileNotFoundWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ IESFileNotFoundWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..IlluminationFailures Class
Autodesk.Revit.DB Namespace